{"Types": [["Enchant Creature", "Enchantment creatures were introduced on a futureshifted card in Future Sight: Lucent Liminid. They later reappeared as a fullfledged mechanic in the Theros set, where they represent the gods themselves , and their emissaries (creatures with bestow). The enchantment creatures were highlighted in the following set, which was named after them: Born of the Gods. These had all global enchantment effects."], ["Land Creature", "Land creature has the properties of both a land and a creature.  It can be tapped for mana as a land, but has power and toughness like a creature.  It has no casting cost to play like a land, but like a creature it has summoning sickness, thus its abilities cannot be used on the first turn it comes into play."], ["Legendary Enchantment Creature", "Gods are indestructable legendary enchantment creatures (living enchantments). For this reason, all enchantments are thought to be gifts from the gods, a unique form of magic enabled by divinities. The gods of Theros grant their favors to those whose devotion is great enough. Gamewise, they don''t manifest as creatures on the battlefield until a player''s devotion to their color is high enough. If a God enters the battlefield while the player''s devotion to its color is less than the required number, abilities that trigger when a creature enters the battlefield won''t trigger. If a God on the battlefield is a creature and the player''s devotion to its color drops below the required number, it immediately stops being a creature. A God can''t attack the turn it enters the battlefield unless it has haste, even if it wasn''t a creature as it entered the battlefield. They are always legendary enchantments, and their abilities work whether they''re creatures or not."], ["Enchantment Creature", "Enchantment creatures were introduced on a futureshifted card in Future Sight: Lucent Liminid. They later reappeared as a fullfledged mechanic in the Theros set, where they represent the gods themselves , and their emissaries (creatures with bestow).  The enchantment creatures were highlighted in the following set, which was named after them: Born of the Gods.  These had all global enchantment effects."], ["Artifact", "Artifacts are permanents that represent magical items, animated constructs, pieces of equipment, or other objects and devices. Up until the introduction of the colorless, non-artifact Eldrazi cards in the Rise of the Eldrazi set, artifacts were distinct from other card types in that they were the only existing cards that had wholly generic mana costs (meaning they can be cast using any type of mana), excluding certain cards which cost 0 Mana."], ["Instant", "Instants, like sorceries, represent one-shot or short-term magical spells.  They are never put into the in-play zone; instead, they take effect when their mana cost is paid and the spell resolves, and then are immediately put into the player''s graveyard.  Sorceries and instants differ only in when they can be played.  Sorceries can only be played during the player''s main phase, and only when nothing else is on the stack. Instants, on the other hand, can be played at any time, including during other player''s turns and while another spell or ability is waiting to resolve."], ["Legendary Enchantment Artifact", "Enchantment artifacts represent the weaponry of the gods. Enchantment creatures and enchantment artifacts in the Theros block all have a unique card frame that shows the starfield of Nyx."], ["Interrupt", "Interrupt is an obsolete card type. It has not been supported by the game since Sixth Edition. Under the original rules, an interrupt was a spell that would resolve before the rest of the Batch. Some examples of interrupts include Counterspell, Red Elemental Blast and Dark Ritual. All Interrupt cards have received errata to make them instants, and all references to Interrupts have been given errata to reference instants."], ["Legendary Artifact", "Legendary is a supertype that can be found on artifacts, creatures, enchantments and lands.  The \"legend rule\" is the name for a rule that prevents a single player from having two or more of the same legendary permanent in play at the same time. This latest version of the rule has been in effect since the release of Magic 2014."], ["Land", "Lands may be tapped to produce mana of one color in Magic.  They cost nothing to play, can only be played once per turn and are immune to the usual 4 or less rule per card type in a deck."], ["Legendary Land", "There may be only one of any legendary permanent with the same name under a player''s control at any one time. If two or more legendary permanents with the same name are in play under one player''s control at the same time, the player chooses and sacrifices one."], ["Artifact Creature", "Artifact creatures are both Artifacts and Creatures. This means that anything that affects either artifacts or creatures affects them. Artifact creatures can be anything from robots, Animated objects, to living creatures infused with metal"], ["Creature", "Creature is used for the further classification of creatures, both cards and tokens. Historically, creature type was simply for purposes relating to flavor; however, as distant as Fallen Empires, creature types have had thematic and mechanistic purposes too."], ["Sorcery", "Sorcery is a card type, and, along with instants, is the only spell type that is not a permanent. A player who has priority may play a sorcery card from his or her hand during a main phase of his or her turn when the stack is empty."], ["Planeswalker", "Planeswalker card types were introduced in Lorwyn. [2] [3] [4] Like the player him or herself, a planeswalker card represents a powerful being that is able to move from plane to plane."], ["Enchantment", "Enchantments represent persistent magical effects, usually remaining in play indefinitely. Most have continuous or triggered abilities, but some have abilities that can be activated by their controllers. "], ["Summon", "A Summon spell, Summon Creature or Summon is an obsolete spell type which had the form of \"Summon <creature>\" in the type line of a card (where <creature> would be the current creature subtype)."], ["Snow Creature", "In addition to snow lands there were a lot of other snow permanents with the release of Coldsnap. Again, this type did nothing of its own but it would matter in the interaction with other cards such as Chill to the Bone."], ["Legendary Creature", "Similar in type to creature with the restriction that only instance of this card can be allowed in play at one time.  If a controller has two of the same name, he must choose to sacrifice one."], ["Eaturecray", "Type created in unhinged set.  Done entirely in Pig Latin.  The card reads Double Strike, whenever the controller of this card speaks a non pig-latin word, sacrifice it. This piece of flavor text doesn''t really say anything"], ["Basic Land", "Similar to Land in that they can be tapped to gain one mana of the color the land represents.  Can be as many of this type in your deck as you prefer and can only be played once per turn.  These are Island/Mountain/Swamp/Forest/Plain only."]]}
